bench/results/grid-prefix-superseded/2026-08-05-P-def-d64-p1-c8.txt
==============================================================================
pg_resp benchmark raw output — arm P-def — workload d64-p1-c8
==============================================================================
arm            : P-def  (pg_resp on stock postgresql.conf)
workload       : data-size=64 pipeline=1 clients=2 threads=4 => 8 total connections
protocol       : 3 run(s) x 60s, ratio 1:10 SET:GET, key-pattern G:G, key-maximum 1000000 (bible §10)
started (UTC)  : 2026-08-05T19:40:18.340701+00:00
server note    : (none given)
client pinning : docker --cpuset-cpus 4-7 (memtier runs containerised; see bench/harness/box/memtier_benchmark)
warm-up        : v2 fixed key-count — 200000 requested, 200000 actual (25000 per connection x 8 connections), SET-only, G:G over 1M keys, 64 B values
server CPU     : 91 samples over ~91s — min 14.5%  median 103.0%  peak 106.5%  (100% = one logical CPU fully busy)
saturated      : YES (threshold 90% peak; recorded only, not enforced for this cell)
env class      : dedicated — publishable — dedicated-vCPU Linux box per Phase 4 environment amendment
publishable    : YES

credential note: any --authenticate value below is recorded verbatim on
purpose — iron rule 7 requires a command line that actually reruns. Per the
Phase 4 standing rule the benchmark box uses a freshly generated throwaway
password and is destroyed after the sweep; never reuse it anywhere.

memtier invocation (verbatim — this line is the contract, iron rule 7):
  bench/harness/box/memtier_benchmark --host=127.0.0.1 --port=6379 --protocol=redis --ratio=1:10 --data-size=64 --key-pattern=G:G --key-maximum=1000000 --pipeline=1 --clients=2 --threads=4 --test-time=60 --run-count=3 --print-percentiles=50,99,99.9 --hide-histogram --print-all-runs --authenticate=2007c50d0d90210f7fa4cacdd4de1753

warm-up invocation (verbatim):
  bench/harness/box/memtier_benchmark --host=127.0.0.1 --port=6379 --protocol=redis --ratio=1:0 --data-size=64 --key-pattern=G:G --key-maximum=1000000 --pipeline=1 --clients=2 --threads=4 --run-count=1 --hide-histogram --requests=25000 --authenticate=2007c50d0d90210f7fa4cacdd4de1753

regenerate this exact file with:
  bench/harness/sweep.py --arm P-def --port 6379 --data-size 64 --pipeline 1 --clients 2 --threads 4 --test-time 60 --run-count 3 --warmup-keys 200000 --env-class dedicated --client-cpus 4-7 --client-pin-mechanism docker-cpuset --memtier bench/harness/box/memtier_benchmark --require-exclusive --rerun-on-spread --out-dir bench/results/grid --auth-from-pg --psql bench/harness/box/psql --pg-host 127.0.0.1 --pg-port 28818

pre-run and post-run checks:
  - SHOW pg_resp.password -> set (read from the live instance, not assumed)
  - exclusivity: no other arm port answers
  - SET/GET probe OK over the measurement path (b'probe-ok' read back)
  - warm-up: v2 fixed key-count — 200000 requested, 200000 actual (25000 per connection x 8 connections), SET-only, G:G over 1M keys, 64 B values
  - NOAUTH occurrences in output: 0 (must be 0)
  - per-run ops/sec: #1 94,559, #2 95,192, #3 94,640
  - median run: #3 (94,639.60 ops/s) — median, NOT memtier's AGGREGATED AVERAGE (a mean)
  - spread (max-min)/median: 0.67% (threshold 8.0%) -> OK
  - GET hit rate: 16.72% (must be > 0)

live server configuration, read from the RUNNING server (ENV.md §21.3):
  SHOW pg_resp.max_memory = 256MB
  SHOW pg_resp.eviction = clock_lru
  SHOW pg_resp.bind_address = 127.0.0.1
  SHOW shared_preload_libraries = pg_resp.so
  SHOW shared_buffers = 128MB
  SHOW synchronous_commit = on

server CPU samples, ~1s apart (total, then per container):
      92.9%  pg_resp_bench_pg=92.9%
     103.3%  pg_resp_bench_pg=103.3%
     103.2%  pg_resp_bench_pg=103.2%
     103.3%  pg_resp_bench_pg=103.3%
     103.3%  pg_resp_bench_pg=103.3%
     102.5%  pg_resp_bench_pg=102.5%
     102.4%  pg_resp_bench_pg=102.4%
     102.6%  pg_resp_bench_pg=102.6%
     102.5%  pg_resp_bench_pg=102.5%
     103.4%  pg_resp_bench_pg=103.4%
     103.0%  pg_resp_bench_pg=103.0%
     103.2%  pg_resp_bench_pg=103.2%
     103.1%  pg_resp_bench_pg=103.1%
     103.2%  pg_resp_bench_pg=103.2%
     103.2%  pg_resp_bench_pg=103.2%
     102.9%  pg_resp_bench_pg=102.9%
     103.0%  pg_resp_bench_pg=103.0%
     103.0%  pg_resp_bench_pg=103.0%
     103.2%  pg_resp_bench_pg=103.2%
     103.0%  pg_resp_bench_pg=103.0%
     103.7%  pg_resp_bench_pg=103.7%
     103.3%  pg_resp_bench_pg=103.3%
     103.7%  pg_resp_bench_pg=103.7%
     102.9%  pg_resp_bench_pg=102.9%
     102.8%  pg_resp_bench_pg=102.8%
     102.8%  pg_resp_bench_pg=102.8%
     106.5%  pg_resp_bench_pg=106.5%
     103.0%  pg_resp_bench_pg=103.0%
     103.6%  pg_resp_bench_pg=103.6%
     102.5%  pg_resp_bench_pg=102.5%
      53.1%  pg_resp_bench_pg=53.1%
     102.7%  pg_resp_bench_pg=102.7%
     103.3%  pg_resp_bench_pg=103.3%
     103.3%  pg_resp_bench_pg=103.3%
     102.4%  pg_resp_bench_pg=102.4%
     103.0%  pg_resp_bench_pg=103.0%
     102.9%  pg_resp_bench_pg=102.9%
     102.4%  pg_resp_bench_pg=102.4%
     103.2%  pg_resp_bench_pg=103.2%
     103.0%  pg_resp_bench_pg=103.0%
     103.0%  pg_resp_bench_pg=103.0%
     103.5%  pg_resp_bench_pg=103.5%
     103.3%  pg_resp_bench_pg=103.3%
     103.3%  pg_resp_bench_pg=103.3%
     102.7%  pg_resp_bench_pg=102.7%
     103.0%  pg_resp_bench_pg=103.0%
     102.8%  pg_resp_bench_pg=102.8%
     103.3%  pg_resp_bench_pg=103.3%
     103.4%  pg_resp_bench_pg=103.4%
     102.8%  pg_resp_bench_pg=102.8%
     102.9%  pg_resp_bench_pg=102.9%
     103.0%  pg_resp_bench_pg=103.0%
     103.2%  pg_resp_bench_pg=103.2%
     102.5%  pg_resp_bench_pg=102.5%
     102.8%  pg_resp_bench_pg=102.8%
     103.2%  pg_resp_bench_pg=103.2%
     104.7%  pg_resp_bench_pg=104.7%
     103.3%  pg_resp_bench_pg=103.3%
     103.1%  pg_resp_bench_pg=103.1%
     103.0%  pg_resp_bench_pg=103.0%
      14.5%  pg_resp_bench_pg=14.5%
     103.1%  pg_resp_bench_pg=103.1%
     103.0%  pg_resp_bench_pg=103.0%
     103.4%  pg_resp_bench_pg=103.4%
     103.4%  pg_resp_bench_pg=103.4%
     103.1%  pg_resp_bench_pg=103.1%
     103.2%  pg_resp_bench_pg=103.2%
     102.9%  pg_resp_bench_pg=102.9%
     102.4%  pg_resp_bench_pg=102.4%
     103.3%  pg_resp_bench_pg=103.3%
     102.7%  pg_resp_bench_pg=102.7%
     103.0%  pg_resp_bench_pg=103.0%
     103.1%  pg_resp_bench_pg=103.1%
     102.8%  pg_resp_bench_pg=102.8%
     103.0%  pg_resp_bench_pg=103.0%
     102.9%  pg_resp_bench_pg=102.9%
     102.1%  pg_resp_bench_pg=102.1%
     102.6%  pg_resp_bench_pg=102.6%
     103.0%  pg_resp_bench_pg=103.0%
     102.9%  pg_resp_bench_pg=102.9%
     102.9%  pg_resp_bench_pg=102.9%
     103.3%  pg_resp_bench_pg=103.3%
     103.3%  pg_resp_bench_pg=103.3%
     102.6%  pg_resp_bench_pg=102.6%
     103.0%  pg_resp_bench_pg=103.0%
     102.5%  pg_resp_bench_pg=102.5%
     102.6%  pg_resp_bench_pg=102.6%
     102.6%  pg_resp_bench_pg=102.6%
     103.4%  pg_resp_bench_pg=103.4%
     102.8%  pg_resp_bench_pg=102.8%
      22.8%  pg_resp_bench_pg=22.8%

==============================================================================
raw memtier output follows
==============================================================================
4         Threads
2         Connections per thread
60        Seconds


RUN #1 RESULTS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         8596.35          ---          ---         0.08569         0.08700         0.10300         0.11900       923.38 
Gets        85962.81     10461.35     75501.46         0.08533         0.08700         0.10300         0.11900      3947.63 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      94559.16     10461.35     75501.46         0.08537         0.08700         0.10300         0.11900      4871.01 


RUN #2 RESULTS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         8653.89          ---          ---         0.08497         0.08700         0.10300         0.11900       929.56 
Gets        86538.02     14395.31     72142.71         0.08480         0.08700         0.10300         0.11900      4223.09 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      95191.91     14395.31     72142.71         0.08482         0.08700         0.10300         0.11900      5152.65 


RUN #3 RESULTS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         8603.65          ---          ---         0.08552         0.08700         0.10300         0.11900       924.16 
Gets        86035.95     14385.80     71650.15         0.08529         0.08700         0.10300         0.11900      4203.36 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      94639.60     14385.80     71650.15         0.08531         0.08700         0.10300         0.11900      5127.52 


BEST RUN RESULTS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         8596.35          ---          ---         0.08569         0.08700         0.10300         0.11900       923.38 
Gets        85962.81     10461.35     75501.46         0.08533         0.08700         0.10300         0.11900      3947.63 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      94559.16     10461.35     75501.46         0.08537         0.08700         0.10300         0.11900      4871.01 


WORST RUN RESULTS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         8596.35          ---          ---         0.08569         0.08700         0.10300         0.11900       923.38 
Gets        85962.81     10461.35     75501.46         0.08533         0.08700         0.10300         0.11900      3947.63 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      94559.16     10461.35     75501.46         0.08537         0.08700         0.10300         0.11900      4871.01 


AGGREGATED AVERAGE RESULTS (3 runs)
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         8617.96          ---          ---         0.08539         0.08700         0.10300         0.11900       925.70 
Gets        86178.93     13080.82     73098.11         0.08514         0.08700         0.10300         0.11900      4124.69 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      94796.89     13080.82     73098.11         0.08516         0.08700         0.10300         0.11900      5050.40 
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 2%,   1 secs]  4 threads  2 conns:       94664 ops,   94646 (avg:   94646) ops/sec, 9.52MB/sec (avg: 9.52MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 3%,   2 secs]  4 threads  2 conns:      189208 ops,   94532 (avg:   94589) ops/sec, 9.51MB/sec (avg: 9.51MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 5%,   3 secs]  4 threads  2 conns:      283213 ops,   93994 (avg:   94391) ops/sec, 4.91MB/sec (avg: 7.98MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 7%,   4 secs]  4 threads  2 conns:      379107 ops,   95883 (avg:   94764) ops/sec, 4.39MB/sec (avg: 7.08MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 8%,   5 secs]  4 threads  2 conns:      475273 ops,   96155 (avg:   95042) ops/sec, 4.42MB/sec (avg: 6.55MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 10%,   6 secs]  4 threads  2 conns:      569057 ops,   93774 (avg:   94831) ops/sec, 4.33MB/sec (avg: 6.18MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 12%,   7 secs]  4 threads  2 conns:      662417 ops,   93350 (avg:   94619) ops/sec, 4.29MB/sec (avg: 5.91MB/sec),  0.09 (avg:  0.08) msec latency
[RUN #1 13%,   8 secs]  4 threads  2 conns:      756280 ops,   93852 (avg:   94523) ops/sec, 4.34MB/sec (avg: 5.71MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 15%,   9 secs]  4 threads  2 conns:      850158 ops,   93867 (avg:   94450) ops/sec, 4.35MB/sec (avg: 5.56MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 17%,  10 secs]  4 threads  2 conns:      943864 ops,   93696 (avg:   94375) ops/sec, 4.35MB/sec (avg: 5.44MB/sec),  0.09 (avg:  0.08) msec latency
[RUN #1 18%,  11 secs]  4 threads  2 conns:     1039004 ops,   95129 (avg:   94443) ops/sec, 4.41MB/sec (avg: 5.35MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 20%,  12 secs]  4 threads  2 conns:     1134011 ops,   94996 (avg:   94489) ops/sec, 4.45MB/sec (avg: 5.27MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 22%,  13 secs]  4 threads  2 conns:     1228653 ops,   94631 (avg:   94500) ops/sec, 4.43MB/sec (avg: 5.21MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 23%,  14 secs]  4 threads  2 conns:     1321833 ops,   93169 (avg:   94405) ops/sec, 4.34MB/sec (avg: 5.15MB/sec),  0.09 (avg:  0.08) msec latency
[RUN #1 25%,  15 secs]  4 threads  2 conns:     1417047 ops,   95199 (avg:   94458) ops/sec, 4.48MB/sec (avg: 5.10MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 27%,  16 secs]  4 threads  2 conns:     1511318 ops,   94260 (avg:   94446) ops/sec, 4.47MB/sec (avg: 5.06MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 28%,  17 secs]  4 threads  2 conns:     1606073 ops,   94744 (avg:   94463) ops/sec, 4.44MB/sec (avg: 5.02MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 30%,  18 secs]  4 threads  2 conns:     1701244 ops,   95158 (avg:   94502) ops/sec, 4.50MB/sec (avg: 5.00MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 32%,  19 secs]  4 threads  2 conns:     1796655 ops,   95398 (avg:   94549) ops/sec, 4.53MB/sec (avg: 4.97MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 33%,  20 secs]  4 threads  2 conns:     1889879 ops,   93213 (avg:   94482) ops/sec, 4.41MB/sec (avg: 4.94MB/sec),  0.09 (avg:  0.08) msec latency
[RUN #1 35%,  21 secs]  4 threads  2 conns:     1984466 ops,   94576 (avg:   94487) ops/sec, 4.50MB/sec (avg: 4.92MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 37%,  22 secs]  4 threads  2 conns:     2079490 ops,   95013 (avg:   94511) ops/sec, 4.53MB/sec (avg: 4.90MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 38%,  23 secs]  4 threads  2 conns:     2172136 ops,   92635 (avg:   94429) ops/sec, 4.41MB/sec (avg: 4.88MB/sec),  0.09 (avg:  0.08) msec latency
[RUN #1 40%,  24 secs]  4 threads  2 conns:     2265748 ops,   93600 (avg:   94395) ops/sec, 4.48MB/sec (avg: 4.87MB/sec),  0.09 (avg:  0.08) msec latency
[RUN #1 42%,  25 secs]  4 threads  2 conns:     2360770 ops,   95010 (avg:   94419) ops/sec, 4.54MB/sec (avg: 4.85MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 43%,  26 secs]  4 threads  2 conns:     2454806 ops,   94025 (avg:   94404) ops/sec, 4.52MB/sec (avg: 4.84MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 45%,  27 secs]  4 threads  2 conns:     2547910 ops,   93092 (avg:   94355) ops/sec, 4.48MB/sec (avg: 4.83MB/sec),  0.09 (avg:  0.08) msec latency
[RUN #1 47%,  28 secs]  4 threads  2 conns:     2641954 ops,   94032 (avg:   94344) ops/sec, 4.54MB/sec (avg: 4.82MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 48%,  29 secs]  4 threads  2 conns:     2736072 ops,   94106 (avg:   94336) ops/sec, 4.55MB/sec (avg: 4.81MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 50%,  30 secs]  4 threads  2 conns:     2830492 ops,   94409 (avg:   94338) ops/sec, 4.59MB/sec (avg: 4.80MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 52%,  31 secs]  4 threads  2 conns:     2925572 ops,   95069 (avg:   94362) ops/sec, 4.59MB/sec (avg: 4.79MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 53%,  32 secs]  4 threads  2 conns:     3020071 ops,   94487 (avg:   94366) ops/sec, 4.59MB/sec (avg: 4.79MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 55%,  33 secs]  4 threads  2 conns:     3115212 ops,   95129 (avg:   94389) ops/sec, 4.62MB/sec (avg: 4.78MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 57%,  34 secs]  4 threads  2 conns:     3210106 ops,   94882 (avg:   94403) ops/sec, 4.61MB/sec (avg: 4.78MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 58%,  35 secs]  4 threads  2 conns:     3305655 ops,   95540 (avg:   94436) ops/sec, 4.65MB/sec (avg: 4.77MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 60%,  36 secs]  4 threads  2 conns:     3401286 ops,   95620 (avg:   94469) ops/sec, 4.65MB/sec (avg: 4.77MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 62%,  37 secs]  4 threads  2 conns:     3497118 ops,   95820 (avg:   94505) ops/sec, 4.68MB/sec (avg: 4.77MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 63%,  38 secs]  4 threads  2 conns:     3594136 ops,   97005 (avg:   94571) ops/sec, 4.76MB/sec (avg: 4.77MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 65%,  39 secs]  4 threads  2 conns:     3690902 ops,   96755 (avg:   94627) ops/sec, 4.76MB/sec (avg: 4.77MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 67%,  40 secs]  4 threads  2 conns:     3785512 ops,   94599 (avg:   94626) ops/sec, 4.64MB/sec (avg: 4.76MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 68%,  41 secs]  4 threads  2 conns:     3879093 ops,   93570 (avg:   94601) ops/sec, 4.60MB/sec (avg: 4.76MB/sec),  0.09 (avg:  0.08) msec latency
[RUN #1 70%,  42 secs]  4 threads  2 conns:     3974985 ops,   95881 (avg:   94631) ops/sec, 4.73MB/sec (avg: 4.76MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 72%,  43 secs]  4 threads  2 conns:     4069771 ops,   94775 (avg:   94634) ops/sec, 4.71MB/sec (avg: 4.76MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 73%,  44 secs]  4 threads  2 conns:     4165411 ops,   95630 (avg:   94657) ops/sec, 4.77MB/sec (avg: 4.76MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 75%,  45 secs]  4 threads  2 conns:     4260083 ops,   94661 (avg:   94657) ops/sec, 4.70MB/sec (avg: 4.76MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 77%,  46 secs]  4 threads  2 conns:     4354157 ops,   94063 (avg:   94644) ops/sec, 4.71MB/sec (avg: 4.76MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 78%,  47 secs]  4 threads  2 conns:     4448334 ops,   94166 (avg:   94634) ops/sec, 4.71MB/sec (avg: 4.75MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 80%,  48 secs]  4 threads  2 conns:     4542898 ops,   94553 (avg:   94632) ops/sec, 4.74MB/sec (avg: 4.75MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 82%,  49 secs]  4 threads  2 conns:     4638033 ops,   95123 (avg:   94642) ops/sec, 4.74MB/sec (avg: 4.75MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 83%,  50 secs]  4 threads  2 conns:     4732476 ops,   94432 (avg:   94638) ops/sec, 4.73MB/sec (avg: 4.75MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 85%,  51 secs]  4 threads  2 conns:     4826028 ops,   93540 (avg:   94617) ops/sec, 4.70MB/sec (avg: 4.75MB/sec),  0.09 (avg:  0.08) msec latency
[RUN #1 87%,  52 secs]  4 threads  2 conns:     4919200 ops,   93161 (avg:   94589) ops/sec, 4.69MB/sec (avg: 4.75MB/sec),  0.09 (avg:  0.08) msec latency
[RUN #1 88%,  53 secs]  4 threads  2 conns:     5013668 ops,   94459 (avg:   94586) ops/sec, 4.75MB/sec (avg: 4.75MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 90%,  54 secs]  4 threads  2 conns:     5106783 ops,   93105 (avg:   94559) ops/sec, 4.71MB/sec (avg: 4.75MB/sec),  0.09 (avg:  0.08) msec latency
[RUN #1 92%,  55 secs]  4 threads  2 conns:     5201697 ops,   94902 (avg:   94565) ops/sec, 4.80MB/sec (avg: 4.75MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 93%,  56 secs]  4 threads  2 conns:     5296165 ops,   94458 (avg:   94563) ops/sec, 4.80MB/sec (avg: 4.75MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 95%,  57 secs]  4 threads  2 conns:     5390733 ops,   94557 (avg:   94563) ops/sec, 4.81MB/sec (avg: 4.75MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 97%,  58 secs]  4 threads  2 conns:     5485026 ops,   94281 (avg:   94558) ops/sec, 4.83MB/sec (avg: 4.75MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 98%,  59 secs]  4 threads  2 conns:     5580384 ops,   95347 (avg:   94571) ops/sec, 4.83MB/sec (avg: 4.76MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #1 100%,  60 secs]  0 threads  2 conns:     5673559 ops,   95347 (avg:   94559) ops/sec, 4.83MB/sec (avg: 4.76MB/sec),  0.08 (avg:  0.08) msec latency

[RUN #2] Preparing benchmark client...
[RUN #2] Launching threads now...
[RUN #2 2%,   1 secs]  4 threads  2 conns:       93735 ops,   93721 (avg:   93721) ops/sec, 9.43MB/sec (avg: 9.43MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 3%,   2 secs]  4 threads  2 conns:      188961 ops,   95215 (avg:   94468) ops/sec, 9.58MB/sec (avg: 9.50MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 5%,   3 secs]  4 threads  2 conns:      283318 ops,   94345 (avg:   94427) ops/sec, 5.35MB/sec (avg: 8.12MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 7%,   4 secs]  4 threads  2 conns:      378281 ops,   94952 (avg:   94558) ops/sec, 4.85MB/sec (avg: 7.30MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 8%,   5 secs]  4 threads  2 conns:      474366 ops,   96074 (avg:   94861) ops/sec, 4.92MB/sec (avg: 6.82MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 10%,   6 secs]  4 threads  2 conns:      567978 ops,   93601 (avg:   94651) ops/sec, 4.80MB/sec (avg: 6.49MB/sec),  0.09 (avg:  0.08) msec latency
[RUN #2 12%,   7 secs]  4 threads  2 conns:      662382 ops,   94393 (avg:   94614) ops/sec, 4.81MB/sec (avg: 6.25MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 13%,   8 secs]  4 threads  2 conns:      758513 ops,   96119 (avg:   94802) ops/sec, 4.92MB/sec (avg: 6.08MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 15%,   9 secs]  4 threads  2 conns:      853879 ops,   95355 (avg:   94864) ops/sec, 4.88MB/sec (avg: 5.95MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 17%,  10 secs]  4 threads  2 conns:      948646 ops,   94756 (avg:   94853) ops/sec, 4.85MB/sec (avg: 5.84MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 18%,  11 secs]  4 threads  2 conns:     1045498 ops,   96841 (avg:   95034) ops/sec, 4.93MB/sec (avg: 5.76MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 20%,  12 secs]  4 threads  2 conns:     1141680 ops,   96170 (avg:   95129) ops/sec, 4.93MB/sec (avg: 5.69MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 22%,  13 secs]  4 threads  2 conns:     1239146 ops,   97455 (avg:   95307) ops/sec, 4.99MB/sec (avg: 5.63MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 23%,  14 secs]  4 threads  2 conns:     1334215 ops,   95057 (avg:   95290) ops/sec, 4.84MB/sec (avg: 5.58MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 25%,  15 secs]  4 threads  2 conns:     1432507 ops,   98281 (avg:   95489) ops/sec, 5.06MB/sec (avg: 5.54MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 27%,  16 secs]  4 threads  2 conns:     1529437 ops,   96918 (avg:   95578) ops/sec, 4.96MB/sec (avg: 5.50MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 28%,  17 secs]  4 threads  2 conns:     1625277 ops,   95829 (avg:   95593) ops/sec, 4.88MB/sec (avg: 5.47MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 30%,  18 secs]  4 threads  2 conns:     1719525 ops,   94237 (avg:   95518) ops/sec, 4.80MB/sec (avg: 5.43MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 32%,  19 secs]  4 threads  2 conns:     1816199 ops,   96663 (avg:   95578) ops/sec, 4.96MB/sec (avg: 5.41MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 33%,  20 secs]  4 threads  2 conns:     1911794 ops,   95584 (avg:   95578) ops/sec, 4.89MB/sec (avg: 5.38MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 35%,  21 secs]  4 threads  2 conns:     2006787 ops,   94982 (avg:   95550) ops/sec, 4.87MB/sec (avg: 5.36MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 37%,  22 secs]  4 threads  2 conns:     2102682 ops,   95883 (avg:   95565) ops/sec, 4.87MB/sec (avg: 5.33MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 38%,  23 secs]  4 threads  2 conns:     2198676 ops,   95983 (avg:   95583) ops/sec, 4.93MB/sec (avg: 5.32MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 40%,  24 secs]  4 threads  2 conns:     2293665 ops,   94978 (avg:   95558) ops/sec, 4.86MB/sec (avg: 5.30MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 42%,  25 secs]  4 threads  2 conns:     2389411 ops,   95734 (avg:   95565) ops/sec, 4.89MB/sec (avg: 5.28MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 43%,  26 secs]  4 threads  2 conns:     2483333 ops,   93911 (avg:   95501) ops/sec, 4.80MB/sec (avg: 5.26MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 45%,  27 secs]  4 threads  2 conns:     2577166 ops,   93821 (avg:   95439) ops/sec, 4.79MB/sec (avg: 5.25MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 47%,  28 secs]  4 threads  2 conns:     2671881 ops,   94704 (avg:   95413) ops/sec, 4.87MB/sec (avg: 5.23MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 48%,  29 secs]  4 threads  2 conns:     2767730 ops,   95838 (avg:   95428) ops/sec, 4.92MB/sec (avg: 5.22MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 50%,  30 secs]  4 threads  2 conns:     2862779 ops,   95037 (avg:   95415) ops/sec, 4.89MB/sec (avg: 5.21MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 52%,  31 secs]  4 threads  2 conns:     2956231 ops,   93441 (avg:   95351) ops/sec, 4.77MB/sec (avg: 5.20MB/sec),  0.09 (avg:  0.08) msec latency
[RUN #2 53%,  32 secs]  4 threads  2 conns:     3051756 ops,   95514 (avg:   95356) ops/sec, 4.89MB/sec (avg: 5.19MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 55%,  33 secs]  4 threads  2 conns:     3148631 ops,   96864 (avg:   95402) ops/sec, 4.99MB/sec (avg: 5.18MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 57%,  34 secs]  4 threads  2 conns:     3244229 ops,   95588 (avg:   95407) ops/sec, 4.87MB/sec (avg: 5.17MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 58%,  35 secs]  4 threads  2 conns:     3339524 ops,   95285 (avg:   95404) ops/sec, 4.84MB/sec (avg: 5.16MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 60%,  36 secs]  4 threads  2 conns:     3434826 ops,   95291 (avg:   95401) ops/sec, 4.87MB/sec (avg: 5.15MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 62%,  37 secs]  4 threads  2 conns:     3529053 ops,   94217 (avg:   95369) ops/sec, 4.79MB/sec (avg: 5.14MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 63%,  38 secs]  4 threads  2 conns:     3622714 ops,   93650 (avg:   95323) ops/sec, 4.79MB/sec (avg: 5.14MB/sec),  0.09 (avg:  0.08) msec latency
[RUN #2 65%,  39 secs]  4 threads  2 conns:     3719313 ops,   96588 (avg:   95356) ops/sec, 4.91MB/sec (avg: 5.13MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 67%,  40 secs]  4 threads  2 conns:     3815567 ops,   96243 (avg:   95378) ops/sec, 4.91MB/sec (avg: 5.12MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 68%,  41 secs]  4 threads  2 conns:     3909344 ops,   93767 (avg:   95339) ops/sec, 4.78MB/sec (avg: 5.12MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 70%,  42 secs]  4 threads  2 conns:     4004657 ops,   95303 (avg:   95338) ops/sec, 4.86MB/sec (avg: 5.11MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 72%,  43 secs]  4 threads  2 conns:     4100476 ops,   95809 (avg:   95349) ops/sec, 4.93MB/sec (avg: 5.11MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 73%,  44 secs]  4 threads  2 conns:     4195813 ops,   95326 (avg:   95348) ops/sec, 4.87MB/sec (avg: 5.10MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 75%,  45 secs]  4 threads  2 conns:     4290812 ops,   94988 (avg:   95340) ops/sec, 4.88MB/sec (avg: 5.10MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 77%,  46 secs]  4 threads  2 conns:     4386564 ops,   95742 (avg:   95349) ops/sec, 4.90MB/sec (avg: 5.09MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 78%,  47 secs]  4 threads  2 conns:     4481868 ops,   95293 (avg:   95348) ops/sec, 4.89MB/sec (avg: 5.09MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 80%,  48 secs]  4 threads  2 conns:     4575406 ops,   93526 (avg:   95310) ops/sec, 4.75MB/sec (avg: 5.08MB/sec),  0.09 (avg:  0.08) msec latency
[RUN #2 82%,  49 secs]  4 threads  2 conns:     4670977 ops,   95560 (avg:   95315) ops/sec, 4.89MB/sec (avg: 5.08MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 83%,  50 secs]  4 threads  2 conns:     4767832 ops,   96843 (avg:   95345) ops/sec, 4.94MB/sec (avg: 5.07MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 85%,  51 secs]  4 threads  2 conns:     4862325 ops,   94482 (avg:   95329) ops/sec, 4.84MB/sec (avg: 5.07MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 87%,  52 secs]  4 threads  2 conns:     4957261 ops,   94923 (avg:   95321) ops/sec, 4.84MB/sec (avg: 5.06MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 88%,  53 secs]  4 threads  2 conns:     5051537 ops,   94264 (avg:   95301) ops/sec, 4.79MB/sec (avg: 5.06MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 90%,  54 secs]  4 threads  2 conns:     5146735 ops,   95187 (avg:   95299) ops/sec, 4.88MB/sec (avg: 5.06MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 92%,  55 secs]  4 threads  2 conns:     5239701 ops,   92955 (avg:   95256) ops/sec, 4.75MB/sec (avg: 5.05MB/sec),  0.09 (avg:  0.08) msec latency
[RUN #2 93%,  56 secs]  4 threads  2 conns:     5335105 ops,   95392 (avg:   95259) ops/sec, 4.88MB/sec (avg: 5.05MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 95%,  57 secs]  4 threads  2 conns:     5429378 ops,   94262 (avg:   95241) ops/sec, 4.85MB/sec (avg: 5.04MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 97%,  58 secs]  4 threads  2 conns:     5521868 ops,   92478 (avg:   95193) ops/sec, 4.73MB/sec (avg: 5.04MB/sec),  0.09 (avg:  0.08) msec latency
[RUN #2 98%,  59 secs]  4 threads  2 conns:     5616564 ops,   94685 (avg:   95185) ops/sec, 4.81MB/sec (avg: 5.03MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #2 100%,  60 secs]  0 threads  2 conns:     5711524 ops,   94685 (avg:   95191) ops/sec, 4.81MB/sec (avg: 5.03MB/sec),  0.08 (avg:  0.08) msec latency

[RUN #3] Preparing benchmark client...
[RUN #3] Launching threads now...
[RUN #3 2%,   1 secs]  4 threads  2 conns:       94178 ops,   94163 (avg:   94163) ops/sec, 9.47MB/sec (avg: 9.47MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 3%,   2 secs]  4 threads  2 conns:      190330 ops,   96144 (avg:   95153) ops/sec, 9.67MB/sec (avg: 9.57MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 5%,   3 secs]  4 threads  2 conns:      286573 ops,   96231 (avg:   95513) ops/sec, 5.38MB/sec (avg: 8.17MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 7%,   4 secs]  4 threads  2 conns:      381877 ops,   95293 (avg:   95458) ops/sec, 4.87MB/sec (avg: 7.35MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 8%,   5 secs]  4 threads  2 conns:      478150 ops,   96262 (avg:   95619) ops/sec, 4.94MB/sec (avg: 6.87MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 10%,   6 secs]  4 threads  2 conns:      573996 ops,   95835 (avg:   95655) ops/sec, 4.92MB/sec (avg: 6.54MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 12%,   7 secs]  4 threads  2 conns:      668529 ops,   94521 (avg:   95493) ops/sec, 4.81MB/sec (avg: 6.29MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 13%,   8 secs]  4 threads  2 conns:      761560 ops,   93020 (avg:   95184) ops/sec, 4.77MB/sec (avg: 6.10MB/sec),  0.09 (avg:  0.08) msec latency
[RUN #3 15%,   9 secs]  4 threads  2 conns:      855268 ops,   93697 (avg:   95018) ops/sec, 4.80MB/sec (avg: 5.96MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 17%,  10 secs]  4 threads  2 conns:      949722 ops,   94443 (avg:   94961) ops/sec, 4.85MB/sec (avg: 5.85MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 18%,  11 secs]  4 threads  2 conns:     1044462 ops,   94729 (avg:   94940) ops/sec, 4.82MB/sec (avg: 5.75MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 20%,  12 secs]  4 threads  2 conns:     1139086 ops,   94612 (avg:   94912) ops/sec, 4.85MB/sec (avg: 5.68MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 22%,  13 secs]  4 threads  2 conns:     1234989 ops,   95892 (avg:   94988) ops/sec, 4.92MB/sec (avg: 5.62MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 23%,  14 secs]  4 threads  2 conns:     1330209 ops,   95209 (avg:   95004) ops/sec, 4.85MB/sec (avg: 5.56MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 25%,  15 secs]  4 threads  2 conns:     1424865 ops,   94645 (avg:   94980) ops/sec, 4.87MB/sec (avg: 5.52MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 27%,  16 secs]  4 threads  2 conns:     1518990 ops,   94113 (avg:   94925) ops/sec, 4.82MB/sec (avg: 5.48MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 28%,  17 secs]  4 threads  2 conns:     1612766 ops,   93764 (avg:   94857) ops/sec, 4.79MB/sec (avg: 5.43MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 30%,  18 secs]  4 threads  2 conns:     1706348 ops,   93570 (avg:   94786) ops/sec, 4.77MB/sec (avg: 5.40MB/sec),  0.09 (avg:  0.08) msec latency
[RUN #3 32%,  19 secs]  4 threads  2 conns:     1802136 ops,   95776 (avg:   94838) ops/sec, 4.93MB/sec (avg: 5.37MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 33%,  20 secs]  4 threads  2 conns:     1897398 ops,   95250 (avg:   94858) ops/sec, 4.86MB/sec (avg: 5.35MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 35%,  21 secs]  4 threads  2 conns:     1991323 ops,   93914 (avg:   94813) ops/sec, 4.82MB/sec (avg: 5.32MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 37%,  22 secs]  4 threads  2 conns:     2085789 ops,   94455 (avg:   94797) ops/sec, 4.81MB/sec (avg: 5.30MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 38%,  23 secs]  4 threads  2 conns:     2181172 ops,   95371 (avg:   94822) ops/sec, 4.90MB/sec (avg: 5.28MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 40%,  24 secs]  4 threads  2 conns:     2276277 ops,   95094 (avg:   94833) ops/sec, 4.88MB/sec (avg: 5.27MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 42%,  25 secs]  4 threads  2 conns:     2370584 ops,   94295 (avg:   94812) ops/sec, 4.82MB/sec (avg: 5.25MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 43%,  26 secs]  4 threads  2 conns:     2466912 ops,   96317 (avg:   94870) ops/sec, 4.92MB/sec (avg: 5.23MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 45%,  27 secs]  4 threads  2 conns:     2561439 ops,   94513 (avg:   94857) ops/sec, 4.84MB/sec (avg: 5.22MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 47%,  28 secs]  4 threads  2 conns:     2655011 ops,   93563 (avg:   94810) ops/sec, 4.81MB/sec (avg: 5.21MB/sec),  0.09 (avg:  0.08) msec latency
[RUN #3 48%,  29 secs]  4 threads  2 conns:     2750155 ops,   95132 (avg:   94821) ops/sec, 4.88MB/sec (avg: 5.19MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 50%,  30 secs]  4 threads  2 conns:     2845868 ops,   95702 (avg:   94851) ops/sec, 4.92MB/sec (avg: 5.18MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 52%,  31 secs]  4 threads  2 conns:     2940058 ops,   94177 (avg:   94829) ops/sec, 4.82MB/sec (avg: 5.17MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 53%,  32 secs]  4 threads  2 conns:     3035560 ops,   95490 (avg:   94850) ops/sec, 4.89MB/sec (avg: 5.16MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 55%,  33 secs]  4 threads  2 conns:     3130933 ops,   95362 (avg:   94865) ops/sec, 4.91MB/sec (avg: 5.16MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 57%,  34 secs]  4 threads  2 conns:     3225242 ops,   94297 (avg:   94849) ops/sec, 4.83MB/sec (avg: 5.15MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 58%,  35 secs]  4 threads  2 conns:     3318048 ops,   92790 (avg:   94790) ops/sec, 4.72MB/sec (avg: 5.13MB/sec),  0.09 (avg:  0.08) msec latency
[RUN #3 60%,  36 secs]  4 threads  2 conns:     3413349 ops,   95290 (avg:   94804) ops/sec, 4.86MB/sec (avg: 5.13MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 62%,  37 secs]  4 threads  2 conns:     3508397 ops,   95036 (avg:   94810) ops/sec, 4.84MB/sec (avg: 5.12MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 63%,  38 secs]  4 threads  2 conns:     3602045 ops,   93636 (avg:   94779) ops/sec, 4.78MB/sec (avg: 5.11MB/sec),  0.09 (avg:  0.08) msec latency
[RUN #3 65%,  39 secs]  4 threads  2 conns:     3695072 ops,   93016 (avg:   94734) ops/sec, 4.75MB/sec (avg: 5.10MB/sec),  0.09 (avg:  0.08) msec latency
[RUN #3 67%,  40 secs]  4 threads  2 conns:     3789768 ops,   94685 (avg:   94733) ops/sec, 4.83MB/sec (avg: 5.09MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 68%,  41 secs]  4 threads  2 conns:     3883223 ops,   93445 (avg:   94701) ops/sec, 4.75MB/sec (avg: 5.09MB/sec),  0.09 (avg:  0.08) msec latency
[RUN #3 70%,  42 secs]  4 threads  2 conns:     3976493 ops,   93258 (avg:   94667) ops/sec, 4.77MB/sec (avg: 5.08MB/sec),  0.09 (avg:  0.08) msec latency
[RUN #3 72%,  43 secs]  4 threads  2 conns:     4070526 ops,   94020 (avg:   94652) ops/sec, 4.82MB/sec (avg: 5.07MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 73%,  44 secs]  4 threads  2 conns:     4165322 ops,   94785 (avg:   94655) ops/sec, 4.88MB/sec (avg: 5.07MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 75%,  45 secs]  4 threads  2 conns:     4258048 ops,   92713 (avg:   94612) ops/sec, 4.73MB/sec (avg: 5.06MB/sec),  0.09 (avg:  0.08) msec latency
[RUN #3 77%,  46 secs]  4 threads  2 conns:     4352624 ops,   94563 (avg:   94611) ops/sec, 4.87MB/sec (avg: 5.06MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 78%,  47 secs]  4 threads  2 conns:     4448304 ops,   95669 (avg:   94633) ops/sec, 4.90MB/sec (avg: 5.05MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 80%,  48 secs]  4 threads  2 conns:     4542696 ops,   94381 (avg:   94628) ops/sec, 4.82MB/sec (avg: 5.05MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 82%,  49 secs]  4 threads  2 conns:     4636414 ops,   93707 (avg:   94609) ops/sec, 4.78MB/sec (avg: 5.04MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 83%,  50 secs]  4 threads  2 conns:     4732353 ops,   95927 (avg:   94635) ops/sec, 4.90MB/sec (avg: 5.04MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 85%,  51 secs]  4 threads  2 conns:     4827707 ops,   95344 (avg:   94649) ops/sec, 4.87MB/sec (avg: 5.04MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 87%,  52 secs]  4 threads  2 conns:     4921094 ops,   93375 (avg:   94625) ops/sec, 4.77MB/sec (avg: 5.03MB/sec),  0.09 (avg:  0.08) msec latency
[RUN #3 88%,  53 secs]  4 threads  2 conns:     5017045 ops,   95939 (avg:   94650) ops/sec, 4.89MB/sec (avg: 5.03MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 90%,  54 secs]  4 threads  2 conns:     5113254 ops,   96198 (avg:   94678) ops/sec, 4.92MB/sec (avg: 5.03MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 92%,  55 secs]  4 threads  2 conns:     5207145 ops,   93880 (avg:   94664) ops/sec, 4.80MB/sec (avg: 5.02MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 93%,  56 secs]  4 threads  2 conns:     5300729 ops,   93573 (avg:   94644) ops/sec, 4.80MB/sec (avg: 5.02MB/sec),  0.09 (avg:  0.08) msec latency
[RUN #3 95%,  57 secs]  4 threads  2 conns:     5395661 ops,   94920 (avg:   94649) ops/sec, 4.87MB/sec (avg: 5.02MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 97%,  58 secs]  4 threads  2 conns:     5489725 ops,   94053 (avg:   94639) ops/sec, 4.84MB/sec (avg: 5.01MB/sec),  0.08 (avg:  0.08) msec latency
[RUN #3 98%,  59 secs]  4 threads  2 conns:     5582778 ops,   93041 (avg:   94612) ops/sec, 4.72MB/sec (avg: 5.01MB/sec),  0.09 (avg:  0.08) msec latency
[RUN #3 100%,  60 secs]  0 threads  2 conns:     5678390 ops,   93041 (avg:   94639) ops/sec, 4.72MB/sec (avg: 5.01MB/sec),  0.09 (avg:  0.08) msec latency

warning: GET miss rate 87.83% above target 1.00% (4530095 misses / 5157777 ops)

CPU Utilization Summary
  Total CPU time:   101.940s  (user 25.018s, sys 76.922s)
  Wall time:        60.000s
  Cores used:       1.699   (avg 42.5% across 4 worker threads)
  Peak utilization: 176.3%
warning: GET miss rate 83.37% above target 1.00% (4328570 misses / 5192290 ops)

CPU Utilization Summary
  Total CPU time:   101.795s  (user 25.315s, sys 76.480s)
  Wall time:        60.000s
  Cores used:       1.697   (avg 42.4% across 4 worker threads)
  Peak utilization: 177.2%
warning: GET miss rate 83.28% above target 1.00% (4299020 misses / 5162170 ops)

CPU Utilization Summary
  Total CPU time:   102.073s  (user 24.863s, sys 77.209s)
  Wall time:        60.000s
  Cores used:       1.701   (avg 42.5% across 4 worker threads)
  Peak utilization: 175.6%
warning: GET miss rate 87.83% above target 1.00% (4530095 misses / 5157777 ops)

CPU Utilization Summary
  Total CPU time:   101.940s  (user 25.018s, sys 76.922s)
  Wall time:        60.000s
  Cores used:       1.699   (avg 42.5% across 4 worker threads)
  Peak utilization: 176.3%
warning: GET miss rate 87.83% above target 1.00% (4530095 misses / 5157777 ops)

CPU Utilization Summary
  Total CPU time:   101.940s  (user 25.018s, sys 76.922s)
  Wall time:        60.000s
  Cores used:       1.699   (avg 42.5% across 4 worker threads)
  Peak utilization: 176.3%

CPU Utilization Summary
  Total CPU time:   305.807s  (user 75.196s, sys 230.611s)
  Wall time:        180.001s
  Cores used:       1.699   (avg 42.5% across 4 worker threads)
  Peak utilization: 177.2%